FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478_USBDeviceController.c
/*-------------------------------------------------------------------------*
 * File:  LPC2478_USBDev.c
 *-------------------------------------------------------------------------*
 * Description:
 *      HAL implementation of the LPC2478 USBDev (Ethernet) Driver.
 * Implementation:
 *
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2010 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZLicense.txt or visit http://www.teamfdi.com/uez for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(tm) to your own hardware!  |
 *    |             We can get you up and running fast!               |
 *    |      See http://www.teamfdi.com/uez for more details.         |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/
#include "Config.h"
#include <uEZTypes.h>
#include <uEZProcessor.h>
#include <HAL/Interrupt.h>
#include <Source/Processor/NXP/LPC2478/LPC2478_USBDeviceController.h>
// TBD:  not here!
#include <uEZRTOS.h>

/*-------------------------------------------------------------------------*
 * USB Registers:
 *-------------------------------------------------------------------------*/

#ifndef USBIntSt
// USB Interrupt Status
#define USBIntSt        CPUReg32(0xE01FC1C0)

// USB Device Interrupt Registers:
#define USBDevIntSt     CPUReg32(0xFFE0C200)
#define USBDevIntEn     CPUReg32(0xFFE0C204)
#define USBDevIntClr	CPUReg32(0xFFE0C208)
#define USBDevIntSet	CPUReg32(0xFFE0C20C)
#define USBDevIntPri	CPUReg32(0xFFE0C22C)
// Endpoint Interrupt Registers
#define USBEpIntSt      CPUReg32(0xFFE0C230)
#define USBEpIntEn      CPUReg32(0xFFE0C234)
#define USBEpIntClr     CPUReg32(0xFFE0C238)
#define USBEpIntSet     CPUReg32(0xFFE0C23C)
#define USBEpIntPri     CPUReg32(0xFFE0C240)

// Endpoint Realization Registers
#define USBReEp         CPUReg32(0xFFE0C244)
#define USBEpInd        CPUReg32(0xFFE0C248)
#define USBEpMaxPSize     CPUReg32(0xFFE0C24C)

// USB Transfer registers
#define USBRxData               CPUReg32(0xFFE0C218)
#define USBRxPLen               CPUReg32(0xFFE0C220)
#define USBTxData               CPUReg32(0xFFE0C21C)
#define USBTxPLen               CPUReg32(0xFFE0C224)
#define USBCtrl                 CPUReg32(0xFFE0C228)

// Command registers
#define USBCmdCode      CPUReg32(0xFFE0C210)
#define USBCmdData      CPUReg32(0xFFE0C214)
#endif

#define dprintf(...)

    // USB Device Interrupts Bits:
        // every 1 ms interrupt (for isochronous packet transfers)
        #define USB_FRAME                       (1<<0)

        // Fast interrupt transfer
        #define EP_FAST                     (1<<1)

        // Slow interrupt tranfer
        #define EP_SLOW                     (1<<2)

        // Device status changed
        #define DEV_STAT                    (1<<3)

        // Command code register is empty (new commands can be written)
        #define CCEMTY                      (1<<4)

        // Command data register is full (data can be read now)
        #define CDFULL                      (1<<5)

        // Current packet in FIFO has been transferred to the CPU
        #define RxENDPKT                    (1<<6)

        // The number of data bytes transferred to the FIFO equals
        // the number of bytes programmed in the TxPacket length register
        #define TxENDPKT                    (1<<7)

        // Endpoints realized.
        #define EP_RLZED                    (1<<8)

        // Error interrupt.
        #define ERR_INT                     (1<<9)


/*-------------------------------------------------------------------------*
 * Constants:
 *-------------------------------------------------------------------------*/
// Device commands:
#define USB_DEVICE_CMD_SET_ADDRESS                      0xD0
    #define USB_DEVICE_SET_ADDRESS_ADDRESS		    (1<<0) // 6 bits
    #define USB_DEVICE_SET_ADDRESS_ENABLE		    (1<<7)
#define USB_DEVICE_CMD_CONFIG                           0xD8
    #define USB_DEVICE_CONFIG                               (1<<0)
#define USB_DEVICE_CMD_SET_MODE                         0xF3
#define USB_DEVICE_CMD_READ_CUR_FRAME_NR                0xF5
#define USB_DEVICE_CMD_READ_TEST_REG                    0xFD
#define USB_DEVICE_CMD_STATUS                           0xFE
#define USB_DEVICE_CMD_GET_ERROR_CODE                   0xFF
#define USB_DEVICE_CMD_READ_ERROR_STATUS                0xFB

// Endpoint commands:
#define USB_ENDPOINT_CMD_SELECT                         0x00
#define USB_ENDPOINT_CMD_SELECT_CLEAR                   0x40
#define USB_ENDPOINT_CMD_SET_STATUS                     0x40
    #define ENDPOINT_STATUS_STALLED                         (1<<0)
    #define ENDPOINT_STATUS_DISABLED                        (1<<5)
    #define ENDPOINT_STATUS_RATE_FEEDBACK_MODE              (1<<6)
    #define ENDPOINT_STATUS_CONDITIONAL_STALL               (1<<7)
#define USB_ENDPOINT_CMD_CLEAR_BUFFER                   0xF2
#define USB_ENDPOINT_CMD_VALIDATE_BUFFER                0xFA

// Bits: USBCtrl
#define RD_EN                   (1<<0)
#define WR_EN                   (1<<1)
#define LOG_ENDPOINT            (1<<2)

// Bits: USBRxPLen
#define PKT_LNGTH               (1<<0) // 10 bits
    #define PKT_LNGTH_MASK          ((1<<10)-1)
#define DV                      (1<<10)
#define PKT_RDY                 (1<<11)


/*---------------------------------------------------------------------------*
 * Types:
 *---------------------------------------------------------------------------*/
typedef struct {
    const HAL_USBDeviceController *iHAL;
    T_USBDeviceControllerSettings iSettings;
    TUInt8 iConfigurationNumber;

} T_LPC2478_USBDev_Workspace;

/*---------------------------------------------------------------------------*
 * Globals:
 *---------------------------------------------------------------------------*/
extern const HAL_USBDeviceController LPC2478_USBDev_Interface;
T_LPC2478_USBDev_Workspace *G_LPC2478_USBDev_Workspace=0;

/*---------------------------------------------------------------------------*
 * Prototypes:
 *---------------------------------------------------------------------------*/
static void LPC2478_USBDev_EndpointConfigure(
        void *aWorkspace,
        TUInt8 aEndpoint,
        TUInt16 aMaxPacketSize);

