FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478_USBDeviceController.c
    // enable EP
    LPC2478_USBDev_EndpointEnable(
            p,
            aIndex);
}

/*-------------------------------------------------------------------------*
 * Function:  USBInitialize
 *-------------------------------------------------------------------------*
 * Description:
 *      Initialize the hardware
 * Inputs:
 *      void *aWorkspace          -- USBDev Controller's workspace
 *-------------------------------------------------------------------------*/
void LPC2478_USBDev_Initialize(void *aWorkspace)
{
    extern void USBSharedInterruptSetup(void);
    TUInt8 i;
    T_LPC2478_USBDev_Workspace *p = (T_LPC2478_USBDev_Workspace *)aWorkspace;

    // Ensure power is on
    PCONP |= 0x80000000;

    // Make sure the clock is enabled
    OTG_CLK_CTRL = 0x0000001B;
    while ((OTG_CLK_STAT & 0x0000001B) != 0x1B) {
        ;
    }
    OTG_STAT_CTRL = 0x03;	/* This has to be set after OTG_CLK_CTRL configuration. */

    // Setup standard control endpoints
    LPC2478_USBDev_EndpointConfigure(
        aWorkspace,
        0x00,
        USB_ENDPOINT0_PACKET_SIZE);
    LPC2478_USBDev_EndpointConfigure(
        aWorkspace,
        0x80,
        USB_ENDPOINT0_PACKET_SIZE);

    // Only ACKs generate interrupts
//    LPC2478_USBDev_InterruptNakEnable(aWorkspace, 0);
    LPC2478_USBDev_InterruptNakEnable(aWorkspace, USB_DEVICE_SET_MODE_INAK_BI);

    // Setup interrupts for endpoints
    for (i=0; i<MAX_NUM_ENDPOINTS; i++)  {
        if (p->iSettings.iUSBDevice->iEndpointFuncs[i].iIn)
            LPC2478_USBDev_EndpointInterruptsEnable(aWorkspace,
                USB_ENDPOINT_ADDRESS(i, USB_ENDPOINT_ADDRESS_DIR_IN));
        if (p->iSettings.iUSBDevice->iEndpointFuncs[i].iOut)
            LPC2478_USBDev_EndpointInterruptsEnable(aWorkspace,
                USB_ENDPOINT_ADDRESS(i, USB_ENDPOINT_ADDRESS_DIR_OUT));
    }

    USBSharedInterruptSetup();
}

/*-------------------------------------------------------------------------*
 * Function:  LPC2478_USBDev_GetDescriptor
 *-------------------------------------------------------------------------*
 * Description:
 *      Search for a descriptor in the descriptor table based on the
 *      type and the index (of that type).  Return a pointer to the data
 *      and fill in the length of the data.
 * Inputs:
 *      void *aWorkspace          -- USBDev Controller's workspace
 *      TUInt8 aType              -- Type of descriptor to find
 *      TUInt16 aIndex            -- Index to descriptor (zero based)
 *      TUInt16 *aLength          -- Pointer to place to store length
 * Outputs:
 *      TUInt8 *                  -- Pointer to descriptor, or 0 for none.
 *-------------------------------------------------------------------------*/
const TUInt8 *LPC2478_USBDev_GetDescriptor(
            void *aWorkspace,
            TUInt8 aType,
            TUInt16 aIndex,
            TUInt16 *aLength)
{
    const TUInt8 *p = ((T_LPC2478_USBDev_Workspace *)aWorkspace)->
                    iSettings.iUSBDescriptorTable;
    T_USBDescriptorHeader *p_header = (T_USBDescriptorHeader *)p;

dprintf("[GetDesc %d %d]", aType, aIndex);
    while (p_header->iLength)  {
dprintf("<%p %d %d>", p_header, p_header->iDescriptorType, p_header->iLength);
        if (p_header->iDescriptorType == aType)  {
            if (aIndex==0)  {
                // Found the nth descriptor of the given type
                // Are we a configuration type?
                if (aType == USB_DESCRIPTOR_CONFIGURATION)  {
                    *aLength = ((T_USBDescriptorConfiguration *)p)->iTotalLength;
                } else {
                    *aLength = p_header->iLength;
                }
dprintf("[Found %p]\n", p);
                return p;
            } else {
                // Found the right type, but wrong index.
                // Keep looking.
                aIndex--;
            }
        }
        // Next descriptor
        p += p_header->iLength;
        p_header = (T_USBDescriptorHeader *)p;
    }
dprintf("[Not Found]\n");
    // If we got here, we never found it.
    return 0;
}

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void LPC2478_USBDevice_PortA_Require(
        const T_LPC2478_USBDevice_Settings *aSettings)
{
    static const T_LPC2478_PINSEL_ConfigList pinsVBUS[] = {
            {GPIO_P1_30, 2}, // USB_VBUS
    };
    static const T_LPC2478_PINSEL_ConfigList pinsDP1[] = {
            {GPIO_P0_29, 1}, // USB_D+1
    };
    static const T_LPC2478_PINSEL_ConfigList pinsDM1[] = {
            {GPIO_P0_30, 1}, // USB_D-1
    };
    static const T_LPC2478_PINSEL_ConfigList pinsCONNECT1[] = {
            {GPIO_P2_9,  1}, // USB_CONNECT1
    };
    static const T_LPC2478_PINSEL_ConfigList pinsUP_LED1[] = {
            {GPIO_P1_18, 1}, // USB_UP_LED1
    };

    HAL_DEVICE_REQUIRE_ONCE();
    // Register USB Device
    HALInterfaceRegister("USBDeviceController",
            (T_halInterface *)&LPC2478_USBDev_Interface, 0, 0);

    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iVBUS, pinsVBUS, ARRAY_COUNT(pinsVBUS));
    LPC2478_PINSEL_ConfigPin(aSettings->iDP, pinsDP1, ARRAY_COUNT(pinsDP1));
    LPC2478_PINSEL_ConfigPin(aSettings->iDM, pinsDM1, ARRAY_COUNT(pinsDM1));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iCONNECT, pinsCONNECT1,
            ARRAY_COUNT(pinsCONNECT1));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iUP_LED, pinsUP_LED1,
            ARRAY_COUNT(pinsUP_LED1));
}

void LPC2478_USBDevice_PortB_Require(
        const T_LPC2478_USBDevice_Settings *aSettings)
{
    static const T_LPC2478_PINSEL_ConfigList pinsVBUS[] = {
            {GPIO_P1_30, 2}, // USB_VBUS
    };
    static const T_LPC2478_PINSEL_ConfigList pinsDP2[] = {
            {GPIO_P0_31, 1}, // USB_D+2
    };
    static const T_LPC2478_PINSEL_ConfigList pinsCONNECT2[] = {
            {GPIO_P0_14, 2}, // USB_CONNECT2
    };
    static const T_LPC2478_PINSEL_ConfigList pinsUP_LED2[] = {
            {GPIO_P0_13, 1}, // USB_UP_LED2
    };

    HAL_DEVICE_REQUIRE_ONCE();
    // Register USB Device
    HALInterfaceRegister("USBDeviceController",
            (T_halInterface *)&LPC2478_USBDev_Interface, 0, 0);

    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iVBUS, pinsVBUS, ARRAY_COUNT(pinsVBUS));
    LPC2478_PINSEL_ConfigPin(aSettings->iDP, pinsDP2, ARRAY_COUNT(pinsDP2));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iDM, 0, 0);
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iCONNECT, pinsCONNECT2,
            ARRAY_COUNT(pinsCONNECT2));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iUP_LED, pinsUP_LED2,
            ARRAY_COUNT(pinsUP_LED2));
}

/*---------------------------------------------------------------------------*
 * HAL Interface table:
 *---------------------------------------------------------------------------*/
const HAL_USBDeviceController LPC2478_USBDev_Interface = {
    "NXP:LPC2478:USB Device Controller",
    0x0100,
    LPC2478_USBDev_InitializeWorkspace,
    sizeof(T_LPC2478_USBDev_Workspace),

    LPC2478_USBDev_Configure,
    LPC2478_USBDev_Initialize,
    LPC2478_USBDev_Connect,
    LPC2478_USBDev_Disconnect,
    LPC2478_USBDev_SetAddress,
    LPC2478_USBDev_SetConfiguration,
    LPC2478_USBDev_GetConfiguration,
    LPC2478_USBDev_EndpointConfigure,
    LPC2478_USBDev_Read,
    LPC2478_USBDev_Write,
    LPC2478_USBDev_SetStallState,
    LPC2478_USBDev_IsStalled,
    LPC2478_USBDev_EndpointInterruptsEnable,
    LPC2478_USBDev_EndpointInterruptsDisable,
    LPC2478_USBDev_ForceAddressAndConfiguration,
    LPC2478_USBDev_ProcessEndpoints,
    LPC2478_USBDev_GetDescriptor,
    LPC2478_USBDev_InterruptNakEnable,
};

/*-------------------------------------------------------------------------*
 * End of File:  USBDev.c
 *-------------------------------------------------------------------------*/
